MaJerle/stm32-cube-cmake-vscode/script-projects/h735g-dk-touchgfx/Drivers/BSP/Components/ft5336/ft5336_reg.h
/**
 ******************************************************************************
 * @file    ft5336_reg.h
 * @author  MCD Application Team
 * @brief   Header of ft5336_reg.c
 *
 ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef FT5336_REG_H
#define FT5336_REG_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/* Macros --------------------------------------------------------------------*/

/** @addtogroup BSP
 * @{
 */

/** @addtogroup Component
 * @{
 */

/** @addtogroup FT5336
 * @{
 */

/* Exported types ------------------------------------------------------------*/

/** @defgroup FT5336_Exported_Types FT5336 Exported Types
 * @{
 */
/************** Generic Function  *******************/

typedef int32_t (*FT5336_Write_Func)(void*, uint8_t, uint8_t*, uint16_t);
typedef int32_t (*FT5336_Read_Func) (void*, uint8_t, uint8_t*, uint16_t);

/**
 * @}
 */

/** @defgroup FT5336_Imported_Globals FT5336 Imported Globals
 * @{
 */
typedef struct {
    FT5336_Write_Func   WriteReg;
    FT5336_Read_Func    ReadReg;
    void*                handle;
} ft5336_ctx_t;
/**
 * @}
 */

/** @defgroup FT5336_Exported_Constants FT5336 Exported Constants
 * @{
 */

/* Current mode register of the FT5336 (R/W) */
#define FT5336_DEV_MODE_REG         0x00

/* Gesture ID register */
#define FT5336_GEST_ID_REG          0x01

/* Touch Data Status register : gives number of active touch points (0..2) */
#define FT5336_TD_STAT_REG          0x02

/* P1 X, Y coordinates, weight and misc registers */
#define FT5336_P1_XH_REG            0x03U
#define FT5336_P1_XL_REG            0x04U
#define FT5336_P1_YH_REG            0x05U
#define FT5336_P1_YL_REG            0x06U
#define FT5336_P1_WEIGHT_REG        0x07U
#define FT5336_P1_MISC_REG          0x08U

/* P2 X, Y coordinates, weight and misc registers */
#define FT5336_P2_XH_REG            0x09U
#define FT5336_P2_XL_REG            0x0AU
#define FT5336_P2_YH_REG            0x0BU
#define FT5336_P2_YL_REG            0x0CU
#define FT5336_P2_WEIGHT_REG        0x0DU
#define FT5336_P2_MISC_REG          0x0EU

/* P3 X, Y coordinates, weight and misc registers */
#define FT5336_P3_XH_REG            0x0FU
#define FT5336_P3_XL_REG            0x10U
#define FT5336_P3_YH_REG            0x11U
#define FT5336_P3_YL_REG            0x12U
#define FT5336_P3_WEIGHT_REG        0x13U
#define FT5336_P3_MISC_REG          0x14U

/* P4 X, Y coordinates, weight and misc registers */
#define FT5336_P4_XH_REG            0x15U
#define FT5336_P4_XL_REG            0x16U
#define FT5336_P4_YH_REG            0x17U
#define FT5336_P4_YL_REG            0x18U
#define FT5336_P4_WEIGHT_REG        0x19U
#define FT5336_P4_MISC_REG          0x1AU

/* P5 X, Y coordinates, weight and misc registers */
#define FT5336_P5_XH_REG            0x1BU
#define FT5336_P5_XL_REG            0x1CU
#define FT5336_P5_YH_REG            0x1DU
#define FT5336_P5_YL_REG            0x1EU
#define FT5336_P5_WEIGHT_REG        0x1FU
#define FT5336_P5_MISC_REG          0x20U

/* P6 X, Y coordinates, weight and misc registers */
#define FT5336_P6_XH_REG            0x21U
#define FT5336_P6_XL_REG            0x22U
#define FT5336_P6_YH_REG            0x23U
#define FT5336_P6_YL_REG            0x24U
#define FT5336_P6_WEIGHT_REG        0x25U
#define FT5336_P6_MISC_REG          0x26U

/* P7 X, Y coordinates, weight and misc registers */
#define FT5336_P7_XH_REG            0x27U
#define FT5336_P7_XL_REG            0x28U
#define FT5336_P7_YH_REG            0x29U
#define FT5336_P7_YL_REG            0x2AU
#define FT5336_P7_WEIGHT_REG        0x2BU
#define FT5336_P7_MISC_REG          0x2CU

/* P8 X, Y coordinates, weight and misc registers */
#define FT5336_P8_XH_REG            0x2DU
#define FT5336_P8_XL_REG            0x2EU
#define FT5336_P8_YH_REG            0x2FU
#define FT5336_P8_YL_REG            0x30U
#define FT5336_P8_WEIGHT_REG        0x31U
#define FT5336_P8_MISC_REG          0x32U

/* P9 X, Y coordinates, weight and misc registers */
#define FT5336_P9_XH_REG            0x33U
#define FT5336_P9_XL_REG            0x34U
#define FT5336_P9_YH_REG            0x35U
#define FT5336_P9_YL_REG            0x36U
#define FT5336_P9_WEIGHT_REG        0x37U
#define FT5336_P9_MISC_REG          0x38U

/* P10 X, Y coordinates, weight and misc registers */
#define FT5336_P10_XH_REG           0x39U
#define FT5336_P10_XL_REG           0x3AU
#define FT5336_P10_YH_REG           0x3BU
#define FT5336_P10_YL_REG           0x3CU
#define FT5336_P10_WEIGHT_REG       0x3DU
#define FT5336_P10_MISC_REG         0x3EU

/* Threshold for touch detection */
#define FT5336_TH_GROUP_REG         0x80

/* Filter function coefficients */
#define FT5336_TH_DIFF_REG          0x85

/* Control register */
#define FT5336_CTRL_REG             0x86

/* The time period of switching from Active mode to Monitor mode when there is no touching */
#define FT5336_TIMEENTERMONITOR_REG 0x87

/* Report rate in Active mode */
#define FT5336_PERIODACTIVE_REG     0x88

/* Report rate in Monitor mode */
#define FT5336_PERIODMONITOR_REG    0x89

/* The value of the minimum allowed angle while Rotating gesture mode */
#define FT5336_RADIAN_VALUE_REG     0x91

/* Maximum offset while Moving Left and Moving Right gesture */
#define FT5336_OFFSET_LR_REG        0x92

/* Maximum offset while Moving Up and Moving Down gesture */
#define FT5336_OFFSET_UD_REG        0x93

