MaJerle/stm32-cube-cmake-vscode/script-projects/h735g-dk-touchgfx/Drivers/BSP/Components/ft5336/ft5336_reg.h
/* Minimum distance while Moving Left and Moving Right gesture */
#define FT5336_DISTANCE_LR_REG      0x94

/* Minimum distance while Moving Up and Moving Down gesture */
#define FT5336_DISTANCE_UD_REG      0x95

/* Maximum distance while Zoom In and Zoom Out gesture */
#define FT5336_DISTANCE_ZOOM_REG    0x96

/* High 8-bit of LIB Version info */
#define FT5336_LIB_VER_H_REG        0xA1

/* Low 8-bit of LIB Version info */
#define FT5336_LIB_VER_L_REG        0xA2

/* Chip Selecting */
#define FT5336_CIPHER_REG           0xA3

/* Interrupt mode register (used when in interrupt mode) */
#define FT5336_GMODE_REG            0xA4

/* Current power mode the FT5336 system is in (R) */
#define FT5336_PWR_MODE_REG         0xA5

/* FT5336 firmware version */
#define FT5336_FIRMID_REG           0xA6

/* FT5336 Chip identification register */
#define FT5336_CHIP_ID_REG          0xA8

/* Release code version */
#define FT5336_RELEASE_CODE_ID_REG  0xAF

/* Current operating mode the FT5336 system is in (R) */
#define FT5336_STATE_REG            0xBC

/**
 * @}
 */

/*******************************************************************************
* Register      : Generic - All
* Address       : Generic - All
* Bit Group Name: None
* Permission    : W
*******************************************************************************/
int32_t ft5336_write_reg(ft5336_ctx_t* ctx, uint8_t reg, uint8_t* pbuf, uint16_t length);
int32_t ft5336_read_reg(ft5336_ctx_t* ctx, uint8_t reg, uint8_t* pbuf, uint16_t length);

/**************** Base Function  *******************/

/*******************************************************************************
* Register      : DEV_MODE
* Address       : 0X00
* Bit Group Name: DEVICE_MODE
* Permission    : RW
*******************************************************************************/
#define   FT5336_DEV_MODE_BIT_MASK        0x70U
#define   FT5336_DEV_MODE_BIT_POSITION    4
int32_t  ft5336_dev_mode_w(ft5336_ctx_t* ctx, uint8_t value);
int32_t  ft5336_dev_mode_r(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : GEST_ID
* Address       : 0X01
* Bit Group Name: Gesture ID
* Permission    : R
*******************************************************************************/
#define   FT5336_GEST_ID_BIT_MASK        0xFFU
#define   FT5336_GEST_ID_BIT_POSITION    0
int32_t ft5336_gest_id(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : TD_STATUS
* Address       : 0X02
* Bit Group Name:
* Permission    : R
*******************************************************************************/
#define   FT5336_TD_STATUS_BIT_MASK        0x0FU
#define   FT5336_TD_STATUS_BIT_POSITION    0
int32_t ft5336_td_status(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P1_XH
* Address       : 0X03
* Bit Group Name: First Event Flag
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   FT5336_P1_XH_EF_BIT_MASK        0xC0U
#define   FT5336_P1_XH_EF_BIT_POSITION    6
int32_t ft5336_p1_xh_ef(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P1_XH
* Address       : 0X03
* Bit Group Name: First Touch X Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   FT5336_P1_XH_TP_BIT_MASK        0x0FU
#define   FT5336_P1_XH_TP_BIT_POSITION    0
int32_t ft5336_p1_xh_tp(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P1_XL
* Address       : 0X04
* Bit Group Name: First Touch X Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P1_XL_TP_BIT_MASK        0xFFU
#define   FT5336_P1_XL_TP_BIT_POSITION    0
int32_t ft5336_p1_xl_tp(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P1_YH
* Address       : 0X05
* Bit Group Name: First Touch ID
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   FT5336_P1_YH_TID_BIT_MASK        0xF0U
#define   FT5336_P1_YH_TID_BIT_POSITION    4
int32_t ft5336_p1_yh_tid(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P1_YH
* Address       : 0x06
* Bit Group Name: First Touch Y Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   FT5336_P1_YH_TP_BIT_MASK        0x0FU
#define   FT5336_P1_YH_TP_BIT_POSITION    0
int32_t ft5336_p1_yh_tp(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P1_YL
* Address       : 0X06
* Bit Group Name: First Touch Y Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P1_YL_TP_BIT_MASK        0xFFU
#define   FT5336_P1_YL_TP_BIT_POSITION    0
int32_t ft5336_p1_yl_tp(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P1_WEIGHT
* Address       : 0X07
* Bit Group Name: First Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P1_WEIGHT_BIT_MASK        0xFFU
#define   FT5336_P1_WEIGHT_BIT_POSITION    0
int32_t ft5336_p1_weight(ft5336_ctx_t* ctx, uint8_t* value);

