MaJerle/stm32-cube-cmake-vscode/script-projects/h735g-dk-touchgfx/Drivers/BSP/Components/ft5336/ft5336_reg.h
/*******************************************************************************
* Register      : P5_YH
* Address       : 0X1D
* Bit Group Name: Fifth Touch ID
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   FT5336_P5_YH_TID_BIT_MASK        0xF0U
#define   FT5336_P5_YH_TID_BIT_POSITION    4
int32_t ft5336_p5_yh_tid(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P5_YH
* Address       : 0x1D
* Bit Group Name: Fifth Touch Y High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   FT5336_P5_YH_TP_BIT_MASK        0x0FU
#define   FT5336_P5_YH_TP_BIT_POSITION    0
int32_t ft5336_p5_yh_tp(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P5_YL
* Address       : 0X1E
* Bit Group Name: Fifth Touch Y Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P5_YL_TP_BIT_MASK        0xFFU
#define   FT5336_P5_YL_TP_BIT_POSITION    0
int32_t ft5336_p5_yl_tp(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P5_WEIGHT
* Address       : 0X1F
* Bit Group Name: Fifth Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P5_WEIGHT_BIT_MASK        0xFFU
#define   FT5336_P5_WEIGHT_BIT_POSITION    0
int32_t ft5336_p5_weight(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : P5_MISC
* Address       : 0X20
* Bit Group Name: Fifth Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P5_MISC_BIT_MASK        0xF0U
#define   FT5336_P5_MISC_BIT_POSITION    4
int32_t ft5336_p5_misc(ft5336_ctx_t* ctx, uint8_t* value);

/*******************************************************************************
* Register      : TH_GROUP
* Address       : 0X80
* Bit Group Name: Threshold for touch detection
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   FT5336_TH_GROUP_BIT_MASK        0xFFU
#define   FT5336_TH_GROUP_BIT_POSITION    0
int32_t ft5336_th_group(ft5336_ctx_t* ctx, uint8_t value);

/*******************************************************************************
* Register      : TH_DIFF
* Address       : 0X85
* Bit Group Name: Filter function coefficient
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   FT5336_TH_DIFF_BIT_MASK        0xFFU
#define   FT5336_TH_DIFF_BIT_POSITION    0
int32_t ft5336_th_diff(ft5336_ctx_t* ctx, uint8_t value);

/*******************************************************************************
* Register      : CTRL
* Address       : 0X86
* Bit Group Name:
* Permission    : RW
* Default value : 0x01
*******************************************************************************/
#define   FT5336_CTRL_BIT_MASK           0xFFU
#define   FT5336_CTRL_BIT_POSITION       0
int32_t ft5336_ctrl(ft5336_ctx_t* ctx, uint8_t value);

/*******************************************************************************
* Register      : TIMEENTERMONITOR
* Address       : 0X87
* Bit Group Name:
* Permission    : RW
* Default value : 0x0A
*******************************************************************************/
#define   FT5336_TIMEENTERMONITOR_BIT_MASK           0xFFU
#define   FT5336_TIMEENTERMONITOR_BIT_POSITION       0
int32_t ft5336_time_enter_monitor(ft5336_ctx_t* ctx, uint8_t value);

/*******************************************************************************
* Register      : PERIODACTIVE
* Address       : 0X88
* Bit Group Name:
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   FT5336_PERIODACTIVE_BIT_MASK           0xFFU
#define   FT5336_PERIODACTIVE_BIT_POSITION       0
int32_t ft5336_period_active(ft5336_ctx_t* ctx, uint8_t value);

/*******************************************************************************
* Register      : PERIODMONITOR
* Address       : 0X89
* Bit Group Name:
* Permission    : RW
* Default value : 0x28
*******************************************************************************/
#define   FT5336_PERIODMONITOR_BIT_MASK           0xFFU
#define   FT5336_PERIODMONITOR_BIT_POSITION       0
int32_t ft5336_period_monitor(ft5336_ctx_t* ctx, uint8_t value);

/*******************************************************************************
* Register      : RADIAN_VALUE
* Address       : 0X91
* Bit Group Name:
* Permission    : RW
* Default value : 0x0A
*******************************************************************************/
#define   FT5336_RADIAN_VALUE_BIT_MASK           0xFFU
#define   FT5336_RADIAN_VALUE_BIT_POSITION       0
int32_t ft5336_radian_value(ft5336_ctx_t* ctx, uint8_t value);

/*******************************************************************************
* Register      : OFFSET_LEFT_RIGHT
* Address       : 0X92
* Bit Group Name:
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   FT5336_OFFSET_LR_BIT_MASK           0xFFU
#define   FT5336_OFFSET_LR_BIT_POSITION       0
int32_t ft5336_offset_left_right(ft5336_ctx_t* ctx, uint8_t value);

/*******************************************************************************
* Register      : OFFSET_UP_DOWN
* Address       : 0X93
* Bit Group Name:
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   FT5336_OFFSET_UD_BIT_MASK           0xFFU
#define   FT5336_OFFSET_UD_BIT_POSITION       0
int32_t ft5336_offset_up_down(ft5336_ctx_t* ctx, uint8_t value);

